#+STARTUP: hideblocks
#+STARTUP: nohideblocks
** 表格公式
Org mode 中的表格的另外一个强大之处，在于它支持公式。
在表格区域使用快捷键 "C-c '"，就可以对表格公式进行编辑，完成后公式会显示在表格下方，以 "#+TBLFM:" 开头
我们也可以在表格下方手工添加以 "+TBLFM:" 开头的行，然后直接添加公式。
| 表格 | 单价 | 数量 | 花费 |
|-----+-----+-----+-----|
| 苹果 | 2.8 |   3 | 8.4 |
| 香蕉 |   4 |   2 |   8 |
| 柚子 |   5 |   4 |  20 |
| 橘子 |   3 |   3 |   9 |
#+TBLFM: $4=$2*$3

上面这个公式表示将第四列的值设为第二列的值与第三列的值的乘积。
在编辑好公式并保存后，将光标移动到公式所在行然后使用 "C-c C-c"，就可以应用公式到表格中。

在Org mode的表格公式中，用 "@" 来表示行，用 "$" 来表示列，最简单的，"@3$2" 表示的是第三行第二列的位置。
使用快捷键 "C-c }" 可以开启表格的横纵坐标显示——若要关闭的话也是用它。如果是用 "C-c '" 来进行公式编辑，在输入表格位置时，会看到表格上对应的位置会在当时高亮，所以建议用这种方式进行编辑。

如果只给一个坐标，则另一个坐标会被设为"当前行"或者"当前列"，这在批量处理表格内容时会有用。

如果想表示一个区域的话，用 ".." 来表示。

下面这个表示左上角为第二行第一列单元格、右下角为第四行第三列单元格的区域，共包含 9 个单元格。
@2$1..@4$3

下面这个则表示"当前行"的第一列到第三列的区域:
$1..$3

在公式中，可以用 "@#" 表示当前行的行号，用 "$#" 表示当前列的列号，在一些稍复杂点的公式里会有用。

此外，还可以定义常量、变量，或者给某个单元格命名，然后引用它们。假设其名字为 "name"，那么 "$name" 就可以引用它了。常量的定义可以通过 "org-table-formula-constants" 来进行，这样定义的常量是全局的；如果要定义局部的常量，可以在org文件中添加诸如这样的行:

#+CONSTANTS: pi=3.14 eps=2.4e-6
还可以在当前表格引用其他表格的域，这需要其他表格被命名为某个名字，如"FOO"，我们要在另一个表格中使用其第三行第四列的域，将其值赋给当前表格的第五行第二列，则可以这样写:

@5$2=remote(FOO, @3$4)
